settings.org

* Auto save and backups
#+BEGIN_SRC emacs-lisp

;; disable auto-save and auto-backup
(setq auto-save-default nil)
(setq make-backup-files nil)

#+END_SRC

* Coding system

#+BEGIN_SRC emacs-lisp

;; UTF-8 please
(setq locale-coding-system 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(set-selection-coding-system 'utf-8)
(prefer-coding-system 'utf-8)

#+END_SRC 

* Package management
#+BEGIN_SRC emacs-lisp
;; Please don't load outdated byte code
(setq load-prefer-newer t)
(require 'package)
(setq package-enable-at-startup nil)
(add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/"))

(package-initialize)

;; Bootstrap `use-package'
(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))

(eval-when-compile
  (require 'use-package))

#+END_SRC

* User Interface
#+BEGIN_SRC emacs-lisp

;; Don't show startup message
(setq inhibit-startup-message t)

;; remove unnecessary gui
(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)

;; change cursor type
(setq-default cursor-type 'bar)

;; load theme
(load-theme 'manoj-dark t)

#+END_SRC

* Which key mode

#+BEGIN_SRC emacs-lisp

(use-package which-key
  :diminish (which-key-mode)
  :config (which-key-mode))

#+END_SRC

* Company mode

#+BEGIN_SRC emacs-lisp

;; company mode
(use-package company
  :diminish company-mode
  :init (setq company-minimum-prefix-length 2)
  :config (global-company-mode 1))

#+END_SRC

* Misc

#+BEGIN_SRC emacs-lisp

; highlight matching parens
(show-paren-mode)

;; highlight current line
(global-hl-line-mode)

;; c customizations
(setq indent-tabs-mode nil)
(setq tab-width 4)
(setq c-default-style "linux"
	    c-basic-offset 4)

#+END_SRC

* Projectile
#+BEGIN_SRC emacs-lisp

;; projectile
(use-package projectile
  :init (setq projectile-enable-caching t)
  (setq projectile-completion-system 'ivy)
  :config (projectile-global-mode))

#+END_SRC
  
* Ivy

#+BEGIN_SRC emacs-lisp

(use-package swiper
  :diminish ivy-mode
  :init (setq ivy-use-virtual-buffers t)
  :config
  (ivy-mode)
  :bind
  ("C-x C-f" . counsel-find-file)
  ("C-x b" . ivy-switch-buffer)
  ("M-x" . counsel-M-x)
  ("C-x c b" . ivy-resume))

(use-package counsel-projectile
  :config
  (counsel-projectile-on))

(use-package smex)

#+END_SRC

* Custom file

#+BEGIN_SRC emacs-lisp

;; no custom config in init file please
(setq custom-file "~/.emacs.d/custom.el")
(load custom-file 'noerror)

#+END_SRC

* org mode

#+BEGIN_SRC emacs-lisp

;; syntax hightlight in org mode 
(setq org-src-fontify-natively t)

#+END_SRC
